---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSetIterator.#ctor
source: html/1f208e9f-bf3b-0b95-b198-dd55af1bf543.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public SpaceSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.